#include<stdio.h>

int main()
{
   int y,f,x,j=0;     /*y:年份 f：该年第一天是星期几 x：该年的所有星期五都是第几天 j：计数*/
   scanf("%d",&y);/*输入年份*/
   f= (((y-1998)+(y-1996)/4-(y-1996)/100+(y-1996)/400)+4)%7;/*该年第一天是星期几.计算方法有问题，2016年第一天应该是周五，计算结果为周六*/
   printf("%d年第一天是星期%d\n",y,f);
   if((y%4==0&&y%100!=0)||(y%400==0))/*如果这一年是闰年*/
   {
     if(f<=5)/*第一天是星期日一二三四五*/
     {
     	for(x=6-f;x<=6-f+365;x+=7)/*周五出现在这一年的第6-f、13-f...天*/
     	{
     		if(x==13||x==44||x==73||x==104||x==134||x==165||x==195||x==226||x==257||x==287||x==318||x==348)/*13号出现在这一年的第13、44、...天*/
                j=j+1;
		 }
		 printf("%d",j);

	 }
	 else/*如果第一天是星期六*/
	 {
	   for(x=7;x<=13-f+365;x+=7)/*周五出现在这一年的第7、14...天*/
     	{
     		if(x==13||x==44||x==73||x==104||x==134||x==165||x==195||x==226||x==257||x==287||x==318||x==348)/*13号出现在这一年的第13、44、...天*/
                j=j+1;
		 }
		 printf("%d",j);
	 }

    }
    else/*如果这一年不是闰年*/
    {
    if(f<=5)/*第一天是星期一二三四五*/
     {
     	for(x=6-f;x<=6-f+364;x+=7)/*周五出现在这一年的第6-f、13-f...天*/
     	{
     		if(x==13||x==44||x==72||x==103||x==133||x==164||x==194||x==225||x==256||x==286||x==317||x==347)/*13号出现在这一年的第13、44、...天*/
                j=j+1;
		 }
		 printf("%d",j);

	 }
	 else
	 {
	   for(x=7;x<=13-f+364;x+=7)/*周五出现在这一年的第7、14...天*/
     	{
     		if(x==13||x==44||x==72||x==103||x==133||x==164||x==194||x==225||x==256||x==286||x==317||x==347)/*13号出现在这一年的第13、44、...天*/
                j=j+1;
		 }
		 printf("%d",j);
	 }
	}
 }
